content/posts/abundance_politics.md
+++
title = "Abundance Politics"
author = ["svejk"]
draft = false
+++

## Abundance Politics {#abundance-politics}

-   [Abundance - Klein, Thompson](https://www.simonandschuster.com/books/Abundance/Ezra-Klein/9781668023488)
-   [Vox - Eric Levitz](https://www.vox.com/politics/405063/ezra-klein-thompson-abundance-book-criticism)
-   [Politico - EV chargers](https://www.politico.com/news/2023/12/05/congress-ev-chargers-billions-00129996)
-   [The Baffler - Malcolm Harris](https://thebaffler.com/latest/whats-the-matter-with-abundance-harris)
-   [Roosevelt Institute - Disgorge the Cash](https://rooseveltinstitute.org/publications/disgorge-the-cash/)
-   [Guardian - Noah Kazis](https://www.theguardian.com/books/2025/mar/27/abundance-by-ezra-klein-and-derek-thompson-review-make-america-build-again)
-   [The American Prospect - Dylan Gyauch-Lewis](https://prospect.org/economy/2024-11-26-abundance-agenda-neoliberalisms-rebrand/)
-   [Washington Monthly - Glastris, Weisberg](https://washingtonmonthly.com/2025/03/23/the-meager-agenda-of-abundance-liberals/)
-   [Slow Boring - Yglesias](https://www.slowboring.com/p/what-abundance-means-to-me)
-   [Democracy - Mike Konczal](https://democracyjournal.org/magazine/76/the-abundance-doctrine/)
-   [Jacobin - Matt Bruenig](https://jacobin.com/2025/03/abundance-klein-thompson-book-review)
-   [The Lever - David Sirota, Aaron Regunberg](https://www.levernews.com/abundance-is-how-dems-lose-to-trump/)
